In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
s2 = pd.Series([10,20,30,40], index=['a','b','c','d'])
s2

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
sales = pd.Series([100,200,300,400], index=['North','South','East','West'])
print("West Sales : ",sales['West'])

West Sales :  400

In [5]:
data = {
    "Name" : ["Joe", "Miller", "James"],
    "Age" : [20,30,35],
    "Department" : ["HR","Finance", "IT"],
    "Salary" : [20000,30000,45000]

}

df = pd.DataFrame(data)
df

     Name  Age Department  Salary
0     Joe   20         HR   20000
1  Miller   30    Finance   30000
2   James   35         IT   45000

In [6]:
df.loc[df.Age>20]

     Name  Age Department  Salary
1  Miller   30    Finance   30000
2   James   35         IT   45000

In [7]:
df.loc[df.Age>20,["Department"]]

  Department
1    Finance
2         IT

In [8]:
df.iloc[1:2]

     Name  Age Department  Salary
1  Miller   30    Finance   30000

In [9]:
df[df.Age>20]

     Name  Age Department  Salary
1  Miller   30    Finance   30000
2   James   35         IT   45000

In [10]:
df["Bonus"] = df["Salary"] * 0.1
df["Salary"] += df["Bonus"]
df

     Name  Age Department   Salary   Bonus
0     Joe   20         HR  22000.0  2000.0
1  Miller   30    Finance  33000.0  3000.0
2   James   35         IT  49500.0  4500.0

In [11]:
df.drop("Bonus", axis=1, inplace=True)
df

     Name  Age Department   Salary
0     Joe   20         HR  22000.0
1  Miller   30    Finance  33000.0
2   James   35         IT  49500.0

In [12]:
df.describe()

             Age        Salary
count   3.000000      3.000000
mean   28.333333  34833.333333
std     7.637626  13841.363131
min    20.000000  22000.000000
25%    25.000000  27500.000000
50%    30.000000  33000.000000
75%    32.500000  41250.000000
max    35.000000  49500.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   Age         3 non-null      int64
 2   Department  3 non-null      object
 3   Salary      3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes

In [14]:
df.shape

(3, 4)

In [16]:
emp_df = pd.read_csv('employee.csv')

In [17]:
emp_df

   EmpID    Name  Age Department  Salary
0    101    John   28         IT   50000
1    102    Emma   34         HR   60000
2    103    Ryan   29    Finance   55000
3    104  Sophia   25  Marketing   52000

In [18]:
emp_df.head()

   EmpID    Name  Age Department  Salary
0    101    John   28         IT   50000
1    102    Emma   34         HR   60000
2    103    Ryan   29    Finance   55000
3    104  Sophia   25  Marketing   52000

In [19]:
emp_df.isnull().sum()

EmpID         0
Name          0
Age           0
Department    0
Salary        0
dtype: int64

In [20]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       4 non-null      int64
 1   Name        4 non-null      object
 2   Age         4 non-null      int64
 3   Department  4 non-null      object
 4   Salary      4 non-null      int64
dtypes: int64(3), object(2)
memory usage: 288.0+ bytes

In [21]:
emp_df.head(3)

   EmpID  Name  Age Department  Salary
0    101  John   28         IT   50000
1    102  Emma   34         HR   60000
2    103  Ryan   29    Finance   55000

In [22]:
emp_df.groupby("Department")["Salary"].sum()

Department
Finance      55000
HR           60000
IT           50000
Marketing    52000
Name: Salary, dtype: int64

In [23]:
import numpy as np

In [24]:
dataf={
    "Name" : ["Joe" , "Miller" , "James" , "Bob"],
    "Age" : [20,30,35,np.nan],
    "Department" : ["HR","Finance","IT",np.nan],
    "Salary" : [np.nan,20000,30000,45000]
}

In [25]:
datadf = pd.DataFrame(dataf)
datadf

     Name   Age Department   Salary
0     Joe  20.0         HR      NaN
1  Miller  30.0    Finance  20000.0
2   James  35.0         IT  30000.0
3     Bob   NaN        NaN  45000.0

In [26]:
datadf.isnull().sum()
datadf.isna()

    Name    Age  Department  Salary
0  False  False       False    True
1  False  False       False   False
2  False  False       False   False
3  False   True        True   False

In [27]:
datadf.fillna({"Name":"Missing Name", "Age": 0,"Department" : "Missing Department","Salary":0})

     Name   Age          Department   Salary
0     Joe  20.0                  HR      0.0
1  Miller  30.0             Finance  20000.0
2   James  35.0                  IT  30000.0
3     Bob   0.0  Missing Department  45000.0

In [28]:
datanf = pd.DataFrame(dataf)
datanf

     Name   Age Department   Salary
0     Joe  20.0         HR      NaN
1  Miller  30.0    Finance  20000.0
2   James  35.0         IT  30000.0
3     Bob   NaN        NaN  45000.0

In [29]:
datanf.dropna()

     Name   Age Department   Salary
1  Miller  30.0    Finance  20000.0
2   James  35.0         IT  30000.0

In [30]:
datacf = pd.DataFrame(dataf)
datacf

     Name   Age Department   Salary
0     Joe  20.0         HR      NaN
1  Miller  30.0    Finance  20000.0
2   James  35.0         IT  30000.0
3     Bob   NaN        NaN  45000.0

In [31]:
datacf['Salary'].dropna()

1    20000.0
2    30000.0
3    45000.0
Name: Salary, dtype: float64

In [32]:
datacf['Age'].ffill()

0    20.0
1    30.0
2    35.0
3    35.0
Name: Age, dtype: float64

In [33]:
datacf['Salary'].bfill()

0    20000.0
1    20000.0
2    30000.0
3    45000.0
Name: Salary, dtype: float64

In [34]:
sales = {
    "Date" : ["2024-01-01","2024-01-02","2024-01-03","2024-01-04"],
    "Region" : ["East", "West", np.nan, "South"] ,
    "Unit_Sold" : [10, np.nan, 15, 12],
    "Units_Price" : [300,250,400,np.nan],

}

sales_df = pd.DataFrame(sales)
sales_df

         Date Region  Unit_Sold  Units_Price
0  2024-01-01   East       10.0        300.0
1  2024-01-02   West        NaN        250.0
2  2024-01-03    NaN       15.0        400.0
3  2024-01-04  South       12.0          NaN

In [35]:
sales_df = sales_df.fillna({"Unit_Sold" : sales_df["Unit_Sold"].mean()})
sales_df["Units_Price"] = sales_df["Units_Price"].ffill()
sales_df

         Date Region  Unit_Sold  Units_Price
0  2024-01-01   East  10.000000        300.0
1  2024-01-02   West  12.333333        250.0
2  2024-01-03    NaN  15.000000        400.0
3  2024-01-04  South  12.000000        400.0

In [36]:
sales_df.dropna(subset=["Region"], inplace=True)
sales_df

         Date Region  Unit_Sold  Units_Price
0  2024-01-01   East  10.000000        300.0
1  2024-01-02   West  12.333333        250.0
3  2024-01-04  South  12.000000        400.0

# Filtering, Grouping, Aggregation

In [37]:
sales_df[sales_df["Unit_Sold"]>10]

         Date Region  Unit_Sold  Units_Price
1  2024-01-02   West  12.333333        250.0
3  2024-01-04  South  12.000000        400.0

In [38]:
sales_df.groupby("Region")["Unit_Sold"].sum()["South"]

np.float64(12.0)

In [39]:
sales_df["Unit_Sold"][sales_df["Region"]=="South"].sum()

np.float64(12.0)

In [40]:
sales_df[sales_df["Region"]=="South"].sum()

Date           2024-01-04
Region              South
Unit_Sold            12.0
Units_Price         400.0
dtype: object

In [41]:
agg = sales_df.groupby("Region")["Unit_Sold"].agg(["min","max","mean"])
agg

              min        max       mean
Region
East    10.000000  10.000000  10.000000
South   12.000000  12.000000  12.000000
West    12.333333  12.333333  12.333333

In [42]:
sales_df.to_dict()

{'Date': {0: '2024-01-01', 1: '2024-01-02', 3: '2024-01-04'},
 'Region': {0: 'East', 1: 'West', 3: 'South'},
 'Unit_Sold': {0: 10.0, 1: 12.333333333333334, 3: 12.0},
 'Units_Price': {0: 300.0, 1: 250.0, 3: 400.0}}

In [43]:
sales_df.to_csv("sales.csv")